In [13]:
print ("Hello")

Hello

In [14]:
!git add .
!git commit -m "Add fresh 01_data_exploration notebook"
!git push origin main --force

On branch main
Your branch is up to date with 'origin/main'.

nothing to commit, working tree clean

Everything up-to-date

In [15]:
import pandas as pd
file_path = "../data/Nigeria National Demand Timeseries.xlsx"
df = pd.read_excel(file_path)
df.head()

,Demand Timeseries,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4
0,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN
2,date time,Year,Quarter,National Unsuppressed Demand,National Suppressed Demand
3,2016-01-01 00:00:00,2016,Q1,4670.268405,2527.804878
4,2016-01-01 01:00:00,2016,Q1,4665.287441,2789.02439

In [16]:
df.describe()

       Demand Timeseries  Unnamed: 1 Unnamed: 2   Unnamed: 3   Unnamed: 4
count               8785        8785       8785  8785.000000  8785.000000
unique              8785           2          5  8784.000000  8499.000000
top            date time        2016         Q3  3973.210413  2426.226935
freq                   1        8784       2208     2.000000    58.000000

In [17]:
df.isnull().sum()

Demand Timeseries    2
Unnamed: 1           2
Unnamed: 2           2
Unnamed: 3           2
Unnamed: 4           2
dtype: int64

In [18]:
df = pd.read_excel(file_path, header = 2)
df.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4
0,date time,Year,Quarter,National Unsuppressed Demand,National Suppressed Demand
1,2016-01-01 00:00:00,2016,Q1,4670.268405,2527.804878
2,2016-01-01 01:00:00,2016,Q1,4665.287441,2789.02439
3,2016-01-01 02:00:00,2016,Q1,4682.517299,2815.121951
4,2016-01-01 03:00:00,2016,Q1,4703.79199,2785.121951

In [19]:
df.drop(0)

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4
1,2016-01-01 00:00:00,2016,Q1,4670.268405,2527.804878
2,2016-01-01 01:00:00,2016,Q1,4665.287441,2789.02439
3,2016-01-01 02:00:00,2016,Q1,4682.517299,2815.121951
4,2016-01-01 03:00:00,2016,Q1,4703.79199,2785.121951
5,2016-01-01 04:00:00,2016,Q1,4857.064195,2794.878049
...,...,...,...,...,...
8780,2016-12-31 18:59:59.998000,2016,Q4,6099.345965,3178.630986
8781,2016-12-31 19:59:59.998000,2016,Q4,6173.292224,3020.387622
8782,2016-12-31 20:59:59.998000,2016,Q4,5859.663577,2930.626564
8783,2016-12-31 21:59:59.998000,2016,Q4,5507.905382,2939.975938
8784,2016-12-31 22:59:59.998000,2016,Q4,5155.935255,2925.990258

In [20]:
df = df.rename(columns={
    'Unnamed: 0': 'Date Time',
    'Unnamed: 1': 'Year',
    'Unnamed: 2': 'Quarter',
    'Unnamed: 3': 'National Unsuppressed Demand',
    'Unnamed: 4': 'National Suppressed Demand'
})

In [21]:
df.head()

,Date Time,Year,Quarter,National Unsuppressed Demand,National Suppressed Demand
0,date time,Year,Quarter,National Unsuppressed Demand,National Suppressed Demand
1,2016-01-01 00:00:00,2016,Q1,4670.268405,2527.804878
2,2016-01-01 01:00:00,2016,Q1,4665.287441,2789.02439
3,2016-01-01 02:00:00,2016,Q1,4682.517299,2815.121951
4,2016-01-01 03:00:00,2016,Q1,4703.79199,2785.121951

In [22]:
df = df.drop(0).reset_index(drop=True)
df.head()

,Date Time,Year,Quarter,National Unsuppressed Demand,National Suppressed Demand
0,2016-01-01 00:00:00,2016,Q1,4670.268405,2527.804878
1,2016-01-01 01:00:00,2016,Q1,4665.287441,2789.02439
2,2016-01-01 02:00:00,2016,Q1,4682.517299,2815.121951
3,2016-01-01 03:00:00,2016,Q1,4703.79199,2785.121951
4,2016-01-01 04:00:00,2016,Q1,4857.064195,2794.878049

In [29]:
!git add .

In [30]:
!git commit -m "Data cleaning and preprocessing"

On branch main
Your branch is up to date with 'origin/main'.

nothing to commit, working tree clean